W6D3/FirstRoutes/app/controllers/artwork_shares_controller.rb

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
  def destroy
    artworkshare = ArtworkShare.find(params[:id])
    artworkshare.destroy

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", "1"], ["viewer_id", "2"], ["created_at", "2019-09-26 18:54:38.040844"], ["updated_at", "2019-09-26 18:54:38.040844"]]
---
  def create
    artworkshare = ArtworkShare.new(artwork_share_params)
    if artworkshare.save