W6D3/FirstRoutes/app/controllers/artworks_controller.rb

  def index
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "starry night"], ["image_url", "googs.co"], ["artist_id", "1"], ["created_at", "2019-09-26 18:27:11.522926"], ["updated_at", "2019-09-26 18:27:11.522926"]]

  def destroy
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
    artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "google.com"], ["updated_at", "2019-09-26 18:27:50.688555"], ["id", 1]]