W6D3/FirstRoutes/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      comments = user.comments
    elsif params[:artwork_id]
      artwork = Artwork.find(params[:artwork_id])