W6D3/FirstRoutes/app/controllers/users_controller.rb

  def index
    if params[:username]
      user = User.find_by(username: params[:username])
    else
      user = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "max"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    # render json: params
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-09-26 17:38:56.760418"], ["updated_at", "2019-09-26 17:38:56.760418"], ["username", "conrad"]]

  def show
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "citrus"], ["updated_at", "2019-09-26 18:09:59.513234"], ["id", 2]]